Reports/б_ОтчетПоБюджетуБОДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>б_ОтчетПоБюджетуБОДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСпискаПодразделений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтрицательноеКрасным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируемыйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/б_Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>б_Бюджет</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.НематериальныеАктивы</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.битИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/б_БюджетФакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>б_БюджетФакт</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.битИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/фин_Бюджетирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>фин_Бюджетирование</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.фин_Бюджетирование</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.фин_Бюджетирование.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценария</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Comment>Сумма оценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_ФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ПорядкиОкругленияОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядкиОкругленияОтчетности</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Окр1</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окр1000000</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияОбъектов</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СчетаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СчетаБюджета</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.фин_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Знак</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБаланса</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.фин_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнакКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтрокиБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/б_ОтчетПоБюджетуБОДС/Ext/ObjectModule.bsl
Перем мСписокИсточниковФинансирования Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем Расшифровки Экспорт;
Перем ПромежуточныеДанные Экспорт;
Перем РежимРасшифровки Экспорт;
Перем ВедётсяУчетПоПодразделениям Экспорт;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	СтандартныеОтчеты.ЗаполнитьДанныеОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	//Результат.Очистить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	//ВыводЗаголовкаОтчета(ЭтотОбъект, Результат);
	ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных);
	СтандартныеОтчеты.ВывестиОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, ВнешниеНаборыДанных);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	// Выполним дополнительную обработку Результата отчета
	ОбработкаРезультатаОтчета(Результат);
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(Результат, ПолучитьТекстЗаголовка(), Строка(глТекущийПользователь));
	
	Возврат;
	
КонецПроцедуры

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ДоработатьКомпоновщикПередВыводом(ВнешниеНаборыДанных) Экспорт
	
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(НачалоПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(КонецПериода));
	Иначе
		ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВыборкаДанных = ПолучитьВыборку();
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ВыборкаДанных);
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаИтого");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Итого "+Формат(Год(НачалоПериода), "ЧГ=0")+" год";
	КонецЕсли;
			
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредыдущийПлан");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
			
		// бит Романов 18.08.2020 ++
		//Если Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2019 Тогда

		//	Поле.Заголовок = "План " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0") + " года (корректировка, оценка)";
		//		
		//КонецЕсли;
		
		Если Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) >= Год(ТекущаяДатаСеанса()) Тогда
			
			Поле.Заголовок = "План " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0") + " года (корректировка, оценка)";
			
		КонецЕсли;
		// бит Романов 18.08.2020 --
			
	КонецЕсли;

		
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредыдущийФакт");
	Если Поле <> Неопределено Тогда
		// бит Романов 18.08.2020 ++
		//Если Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2016 Тогда
		//	Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		//ИначеЕсли Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2017 Тогда
		//	Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		//ИначеЕсли Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) = 2018 Тогда
		//	Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";

		//Иначе
		//	Поле.Заголовок = "Оценка " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		//КонецЕсли;
		
		Если Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))) < Год(ТекущаяДатаСеанса()) Тогда
			Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		Иначе
			Поле.Заголовок = "Факт " + Формат(Год(НачалоДня(Дата(Год(НачалоПериода)-1,1,1))),"ЧГ=0")+" года";
		КонецЕсли;
		// бит Романов 18.08.2020 --
		
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаПредществующий");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1))), "ЧГ=0")+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.НаборыДанных[0].Поля.Найти("СуммаТриГодаНазад");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "Факт "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1))), "ЧГ=0")+" года";
	КонецЕсли;
	
	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение2");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "% к "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1))), "ЧГ=0")+" года";
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПроцентОтклонение3");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-1,1,1))), "ЧГ=0")+" года, %";
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПланКФактуПредшествующий");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-2,1,1))), "ЧГ=0")+" года, %";
	КонецЕсли;

	Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ПланКФактуТриГода");
	Если Поле <> Неопределено Тогда
		Поле.Заголовок = "План "+Формат(Год(НачалоПериода), "ЧГ=0")+" года к факту "+Формат(Год( НачалоДня(Дата(Год(НачалоПериода)-3,1,1))), "ЧГ=0")+" года, %";
	КонецЕсли;

	 
	//Предыдущий период
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредыдущегоПериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредыдущегоПериода", КонецДня(Дата(Год(НачалоПериода)-1,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПредществующегоПериода", НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));

	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериодаТриГода", НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "КонецПериодаТриГода", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));

	

	Если мДеревоСтруктурныхЕдиниц.Колонки.Количество() = 0 Тогда 
		
		СписокСтруктурныхЕдиниц = Новый СписокЗначений;
		СписокСтруктурныхЕдиниц.ЗагрузитьЗначения(мСписокСтруктурныхЕдиниц.ВыгрузитьЗначения());
		
		Для Каждого СтрПодразделение Из мСписокПодразделений Цикл 
			СписокСтруктурныхЕдиниц.Добавить(СтрПодразделение.Значение);
		КонецЦикла;		
				
		мДеревоСтруктурныхЕдиниц = СтандартныеОтчеты.СформироватьДеревоСЕ(, СписокСтруктурныхЕдиниц);
		
	КонецЕсли;
	
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ФормируемыйБюджет", ФормируемыйБюджет);
	ТиповыеОтчеты.УстановитьПараметр(КомпоновщикНастроек, "ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	ТиповыеОтчеты.ДобавитьОтборПоОрганизациямИПодразделениям(КомпоновщикНастроек, мДеревоСтруктурныхЕдиниц);
	
КонецПроцедуры

Процедура ИнициализацияОтчета() Экспорт
	
	СтандартныеОтчеты.ИнициализацияОтчета(ЭтотОбъект);
	
КонецПроцедуры

Процедура ВыводПодписиОтчета(Результат)
	
	//Макет = ПолучитьОбщийМакет("ОбщиеОбластиСтандартногоОтчета");
	//ОбластьПодписи        = Макет.ПолучитьОбласть("ПодписиПроверил");
	//Результат.Вывести(ОбластьПодписи);
	
КонецПроцедуры

Процедура ВыводЗаголовкаОтчета(ОтчетОбъект, Результат)
	
	СтандартныеОтчеты.ВыводЗаголовкаСпециализированногоОтчета(ОтчетОбъект, Результат);
			
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ОрганизацияВНачале = Истина) Экспорт 
		
	ЗаголовокОтчета = "Прогноз движения денег" + СтандартныеОтчеты.ПолучитьПредставлениеПериода(ЭтотОбъект);

	Возврат ?(ОрганизацияВНачале, ЗаголовокОтчета, ЗаголовокОтчета + " " + СтандартныеОтчеты.ПолучитьТекстОрганизация(ЭтотОбъект));
		
КонецФункции

Функция ПолучитьВыборку ()
	
	Запрос = Новый Запрос;
         
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БюджетОбороты.Организация КАК Организация,
	|	БюджетОбороты.СтатьяБюджета КАК СтатьяБюджета,
	|	БюджетОбороты.Статус,
	|	БюджетОбороты.Регистратор КАК ДокументДвижения,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЯнварь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 2
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаФевраль,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаМарт,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаАпрель,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 5
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаМай,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаИюнь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаИюль,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 8
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаАвгуст,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаСентябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОктябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 11
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНоябрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДекабрь,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) < 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПервыйКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) > 3
	|				И МЕСЯЦ(БюджетОбороты.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВторойКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) > 6
	|				И МЕСЯЦ(БюджетОбороты.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаТретийКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) > 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЧетвертыйКвартал,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) < 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЗаПолугодие,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетОбороты.Период) < 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЗаДевятьМесяцев,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаИтого,
	|	0 КАК СуммаИтогоФакт,
	|	0 КАК СуммаПредыдущийПлан,
	|	0 КАК СуммаПредыдущийФакт,
	|	0 КАК СуммаПредществующий,
	|	0 КАК СуммаТриГодаНазад,
	|	0 КАК ПризнакКоличество,
	|	"""" КАК Категория,
	|	"""" КАК Класс
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.б_Бюджет.Обороты(&Началопериода, &КонецПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетОборотыФакт.Организация,
	|	БюджетОборотыФакт.СтатьяБюджета,
	|	БюджетОборотыФакт.Статус,
	|	БюджетОборотыФакт.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетОборотыФакт.СуммаОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	БюджетОборотыФакт.ПризнакКоличествоОборот,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&Началопериода, &КонецПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетОборотыФакт
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетированиеОстаткиИОбороты.Организация,
	|	&СтатьяНачальныхОстатков,
	|	&Статус,
	|	ЗНАЧЕНИЕ(Документ.б_РасчетнаяТаблица.ПУСТАЯССЫЛКА),
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 2
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 5
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 8
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 11
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрНачальныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрБухгалтерии.фин_Бюджетирование.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СчетаБюджета.СтатьяБаланса КАК Счет
	|				ИЗ
	|					Справочник.СчетаБюджета КАК СчетаБюджета
	|				ГДЕ
	|					СчетаБюджета.Владелец = &ФормируемыйБюджет),
	|			,
	|			) КАК БюджетированиеОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетированиеОстаткиИОбороты.Организация,
	|	&СтатьяКонечныхОстатков,
	|	&Статус,
	|	ЗНАЧЕНИЕ(Документ.б_РасчетнаяТаблица.ПУСТАЯССЫЛКА),
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 1
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 2
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 4
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 5
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 7
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 8
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 10
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 11
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 3
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 6
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 9
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МЕСЯЦ(БюджетированиеОстаткиИОбороты.Период) = 12
	|			ТОГДА ВЫБОР
	|					КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|						ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000000
	|					ИНАЧЕ ВЫБОР
	|							КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|								ТОГДА ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0) / 1000
	|							ИНАЧЕ ЕСТЬNULL(БюджетированиеОстаткиИОбороты.СуммаУпрКонечныйОстатокДт, 0)
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрБухгалтерии.фин_Бюджетирование.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			,
	|			Счет В ИЕРАРХИИ
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					СчетаБюджета.СтатьяБаланса КАК Счет
	|				ИЗ
	|					Справочник.СчетаБюджета КАК СчетаБюджета
	|				ГДЕ
	|					СчетаБюджета.Владелец = &ФормируемыйБюджет),
	|			,
	|			) КАК БюджетированиеОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты.Организация,
	|	БюджетФактОбороты.СтатьяБюджета,
	|	БюджетФактОбороты.Статус,
	|	БюджетФактОбороты.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаПланОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаПланОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты.СуммаПланОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты.СуммаОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	БюджетФактОбороты.ПризнакКоличествоОборот,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты_Доп.Организация,
	|	БюджетФактОбороты_Доп.СтатьяБюджета,
	|	БюджетФактОбороты_Доп.Статус,
	|	БюджетФактОбороты_Доп.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	БюджетФактОбороты_Доп.ПризнакКоличествоОборот,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПредществующегоПериода, &КонецПредществующегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты_Доп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетФактОбороты_Доп.Организация,
	|	БюджетФактОбороты_Доп.СтатьяБюджета,
	|	БюджетФактОбороты_Доп.Статус,
	|	БюджетФактОбороты_Доп.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|			ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000000
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|					ТОГДА ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0) / 1000
	|				ИНАЧЕ ЕСТЬNULL(БюджетФактОбороты_Доп.СуммаОборот, 0)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	БюджетФактОбороты_Доп.ПризнакКоличествоОборот,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.б_БюджетФакт.Обороты(&НачалоПериодаТриГода, &КонецПериодаТриГода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетФактОбороты_Доп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БюджетОбороты.Организация,
	|	БюджетОбороты.СтатьяБюджета,
	|	БюджетОбороты.Статус,
	|	БюджетОбороты.Регистратор,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА БюджетОбороты.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(БюджетОбороты.Период) = 1
	|						ТОГДА ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|								ИНАЧЕ ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|											ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|										ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|									КОНЕЦ
	|							КОНЕЦ
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА БюджетОбороты.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВЫБОР
	|							КОГДА МЕСЯЦ(БюджетОбороты.Период) = 12
	|								ТОГДА ВЫБОР
	|										КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|											ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|										ИНАЧЕ ВЫБОР
	|												КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|													ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|												ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|											КОНЕЦ
	|									КОНЕЦ
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				ИНАЧЕ ВЫБОР
	|						КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000000)
	|							ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000000
	|						ИНАЧЕ ВЫБОР
	|								КОГДА &ЕдиницаИзмерения = ЗНАЧЕНИЕ(Перечисление.ПорядкиОкругленияОтчетности.ОКР1000)
	|									ТОГДА ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0) / 1000
	|								ИНАЧЕ ЕСТЬNULL(БюджетОбороты.СуммаОборот, 0)
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	"""",
	|	""""
	|ИЗ
	|	РегистрНакопления.б_Бюджет.Обороты(&НачалоПредыдущегопериода, &КонецПредыдущегоПериода, Регистратор, Бюджет = &ФормируемыйБюджет) КАК БюджетОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Организация,
	|	ВТ.СтатьяБюджета,
	|	ВТ.Статус,
	|	ВТ.ДокументДвижения,
	|	ВТ.СуммаЯнварь,
	|	ВТ.СуммаФевраль,
	|	ВТ.СуммаМарт,
	|	ВТ.СуммаАпрель,
	|	ВТ.СуммаМай,
	|	ВТ.СуммаИюнь,
	|	ВТ.СуммаИюль,
	|	ВТ.СуммаАвгуст,
	|	ВТ.СуммаСентябрь,
	|	ВТ.СуммаОктябрь,
	|	ВТ.СуммаНоябрь,
	|	ВТ.СуммаДекабрь,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаЯнварь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаМарт
	|				ИНАЧЕ ВТ.СуммаПервыйКвартал
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПервыйКвартал,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаАпрель
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаИюнь
	|				ИНАЧЕ ВТ.СуммаВторойКвартал
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаВторойКвартал,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаИюль
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаСентябрь
	|				ИНАЧЕ ВТ.СуммаТретийКвартал
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаТретийКвартал,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаОктябрь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаДекабрь
	|				ИНАЧЕ ВТ.СуммаЧетвертыйКвартал
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаЧетвертыйКвартал,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаЯнварь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаИюнь
	|				ИНАЧЕ ВТ.СуммаЗаПолугодие
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаЗаПолугодие,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаЯнварь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаСентябрь
	|				ИНАЧЕ ВТ.СуммаЗаДевятьМесяцев
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаЗаДевятьМесяцев,
	|	ВЫБОР
	|		КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""140""
	|			ТОГДА ВТ.СуммаЯнварь
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ.СтатьяБюджета.КодСтрокиБюджета = ""150""
	|					ТОГДА ВТ.СуммаДекабрь
	|				ИНАЧЕ ВТ.СуммаИтого
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаИтого,
	|	ВТ.СуммаИтогоФакт,
	|	ВТ.СуммаПредыдущийПлан,
	|	ВТ.СуммаПредыдущийФакт,
	|	ВТ.СуммаПредществующий,
	|	ВТ.ПризнакКоличество,
	|	ВТ.Категория,
	|	ВТ.Класс,
	|	ВТ.СуммаТриГодаНазад
	|ИЗ
	|	ВТ КАК ВТ";
	
	Запрос.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ФормируемыйБюджет",ФормируемыйБюджет);
	Запрос.УстановитьПараметр("СтатьяНачальныхОстатков",ФормируемыйБюджет.СтатьяНачальныхОстатков);
	Запрос.УстановитьПараметр("СтатьяКонечныхОстатков",ФормируемыйБюджет.СтатьяКонечныхОстатков);
	Запрос.УстановитьПараметр("Статус",Перечисления.СостоянияОбъектов.Утвержден);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПредыдущегопериода", НачалоДня(Дата(Год(НачалоПериода)-1,1,1)));
	Запрос.УстановитьПараметр("КонецПредыдущегоПериода",КонецДня(Дата(Год(НачалоПериода)-1,12,31)));
	Запрос.УстановитьПараметр("НачалоПредществующегоПериода",НачалоДня(Дата(Год(НачалоПериода)-2,1,1)));
	Запрос.УстановитьПараметр("КонецПредществующегоПериода", КонецДня(Дата(Год(НачалоПериода)-2,12,31)));
	
	Запрос.УстановитьПараметр("НачалоПериодаТриГода",НачалоДня(Дата(Год(НачалоПериода)-3,1,1)));
	Запрос.УстановитьПараметр("КонецПериодаТриГода", КонецДня(Дата(Год(НачалоПериода)-3,12,31)));

	Возврат Запрос.Выполнить();


КонецФункции

Процедура ОбработкаРезультатаОтчета(Результат)
	
	ТиповыеОтчеты.ОбработкаРезультатаОтчета(ЭтотОбъект, Результат);

КонецПроцедуры

// Для настройки отчета (расшифровка и др.)
Процедура Настроить(Отбор, КомпоновщикНастроекОсновногоОтчета = Неопределено) Экспорт
	
	//ТиповыеОтчеты.НастроитьТиповойОтчет(ЭтотОбъект, Отбор, КомпоновщикНастроекОсновногоОтчета);
	ЗаполнитьНачальныеНастройки();
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт
	
	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	
	СтруктураНастроек.Вставить("мСписокПодразделений", мСписокПодразделений);
	СтруктураНастроек.Вставить("мСписокСтруктурныхЕдиниц", мСписокСтруктурныхЕдиниц);
	СтруктураНастроек.Вставить("мДеревоСтруктурныхЕдиниц", мДеревоСтруктурныхЕдиниц);
	
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);

КонецПроцедуры

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
Процедура ПрименитьНастройку() Экспорт
	
	Если СохраненнаяНастройка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	 
	СтруктураПараметров = СохраненнаяНастройка.ХранилищеНастроек.Получить();
	ТиповыеОтчеты.ПрименитьСтруктуруПараметровОтчета(ЭтотОбъект, СтруктураПараметров);
	
КонецПроцедуры


Расшифровки = Новый СписокЗначений;

НастройкаПериода = Новый НастройкаПериода;

#КонецЕсли
мСписокИсточниковФинансирования = Новый СписокЗначений;
мСписокСтруктурныхЕдиниц = Новый СписокЗначений;
мСписокПодразделений = Новый СписокЗначений;
мДеревоСтруктурныхЕдиниц = Новый ДеревоЗначений;

ВедётсяУчетПоПодразделениям = ОбщегоНазначения.ПолучитьПризнакОтображенияСтруктурныхПодразделений();

РежимРасшифровки = Ложь;
